### 1. 데이터 관리 프로그램
#### 1-1. 파일 시스템 활용

In [8]:
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)

print('슝=3')
# 텍스트 파일에서 불러온 각각의 데이터는 string으로 처리됩니다. 따라서 형변환을 해주세요.

슝=3

In [9]:
employee = Employee('Ahn TaeHee', 'AI Team', '3', '3', '300')

In [10]:
def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)
print('슝=3')

슝=3

In [11]:
import os
file_path = os.getenv("HOME") + '/workplace/aiffel/Fundamentals/dataset/employee/employeefile.txt'
print(file_path)
inputfile = open(file_path, 'r')

for i in inputfile:
    e = make_employee(i)

/home/aiffel0047/workplace/aiffel/Fundamentals/dataset/employee/employeefile.txt

In [12]:
class Employee:
    def get_name(self):
        return self.name
    def get_division(self):
        return self.division
    def get_jobgrade(self):
        return self.jobgrade
    def get_years(self):
        return self.years
    def get_basic(self):
        return self.basic

print('슝=3')

슝=3

In [13]:
# 급여 계산
def get_salary(self):
    self.salary = self.basic + (self.basic * self.years * 0.1)
    return self.salary

In [20]:
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_divison(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

print('슝=3')

슝=3

In [24]:
import os

class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)

def summarize():
    file_path = os.getenv("HOME") + '/workplace/aiffel/Fundamentals/dataset/employee/employeefile.txt'
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

print('슝=3')

슝=3

In [25]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

#### 1-2. Pandas와 csv 파일

- SQL은 데이터 연산 작업이 가능한, "쿼리(query)를 위한 언어"이다.
- 파이썬 기반의 프레임 워크인 Pandas를 이용하면 SQL과 유사한 기능을 수행할 수 있습니다. 당신은 Pandas를 이용하면 많은 파일들에 흩어져 있는 데이터들을 효과적으로 모아서 깔끔하게 처리할 수 있다.

**데이터 합치기: merge, join, concat**
- Pandas에서는 공통으로 연관이 되는 칼럼이 있는 경우에 대해 그 칼럼을 키(key)로 지정해 주어 합치기 연산

**- pd.merge()**
    - 공통의 칼럼에 있는 값을 키로 사용해 데이터 합치기
    - 여기서는 Student가 공통이었기 때문에 Student 필드 값이 키가 되어 이를 기준으로 합쳐진다.
    - on: 키 값을 넣어 주어 공통 칼럼이 여러 개인 경우를 대비해 직접 값을 넣어줄 수 있다.

In [26]:
import pandas as pd

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Math': [100, 55, 38, 43, 68, 82]})

print(df1)
print('---')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
---
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [27]:
pd.merge(df1, df2)

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [28]:
pd.merge(df1, df2, on='Student')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

**pd.merge(how='inner')**
- 겹치는 행이 일부만 있는 경우 inner join 이용
- 공통의 데이터에 대해서만 데이터 합치기
- how 매개변수 기본값은 inner, 아무것도 지정해 주지 않으면 inner join으로 연산

In [29]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Math
0  Jiyoungmin    44
1   KimTaemin    33

In [30]:
pd.merge(df1, df2, how='inner')

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [31]:
pd.merge(df1, df2)

     Student  Korean  English  Math
0  KimTaemin      90       80    33

**pd.merge(how='outer')**
- 전체 데이터에 합치는 연산

In [32]:
pd.merge(df1, df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

**df.join()**
- merge 대신 이용 가능
- join()은 DataFrame 클래스의 메소드

In [35]:
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')   # '_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

**df.concat()**
- 이어 붙이기
- 적층, 연결
- 데이터의 컬럼을 늘리는 것이 아니라 데이터의 행을 합치는 것

In [36]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [37]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [38]:
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

#### 1-3. Pandas 기능들
#### 1-3-1. 필터링 연산

In [39]:
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

#### 1) df['칼럼명'] 형식 사용
데이터 프레임에 대괄호 기호를 쓰고 칼럼명을 입력합니다.

In [40]:
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

#### 2) loc() 사용
loc()은 라벨 을 사용하여 행 또는 열(칼럼)을 지정, 데이터를 추출합니다.

In [ ]:
df.loc[[행],[열]]

In [41]:
print(df.loc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [42]:
print(df.loc[0, 'B'])

2

In [43]:
print(df.loc[:, 'A'])

0    1
1    4
2    7
Name: A, dtype: int64

#### 3) iloc() 사용
iloc()은 정수 인덱스 를 사용하여 행 또는 열(칼럼)을 지정, 데이터를 추출합니다.

In [ ]:
df.iloc[[행],[열]]

In [44]:
print(df.iloc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [45]:
print(df.iloc[:, 0])

0    1
1    4
2    7
Name: A, dtype: int64

In [46]:
## 에러 에러!!
print(df.iloc[0, 'B'])

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [47]:
print(df.iloc[0, 1])

2

#### 1-3-2. 그룹연산: groupby(), apply()
- 값을 선택하거나 데이터를 정렬할 때 기준이 되는 값을 키(key)라고 부릅니다. 
- 일반적인 데이터베이스에서는 이 키 값에 따라 그룹을 묶은(grouping) 뒤 원하는 연산을 수행할 수 있습니다.

**groupby()**
- groupby()객체를 생성
- groupby()객체의 연산을 수행
    - max(), min(), sum(), mean()
    - + apply() 메소드를 통해 특수 수식에 대한 연산을 수행할 수 있습니다.

In [48]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

**apply()**

In [49]:
import numpy as  np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

#### 1-3. Pandas Transform

In [52]:
import pandas as pd
import numpy as np

file_path = os.getenv("HOME") + '/workplace/aiffel/Fundamentals/dataset/employee/Salaries.csv'
sal = pd.read_csv(file_path)

/home/aiffel0047/anaconda3/envs/aiffel/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [53]:
print(sal)

            Id           EmployeeName  \
0            1         NATHANIEL FORD
1            2           GARY JIMENEZ
2            3         ALBERT PARDINI
3            4      CHRISTOPHER CHONG
4            5        PATRICK GARDNER
...        ...                    ...
148640  148641     Charlene D Mccully
148641  148642  Raphael Marquis Goins
148642  148643      Dominic C Marquez
148643  148644             Kim Brewer
148644  148645           Randy D Winn

                                              JobTitle    BasePay  \
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  167411.18
1                      CAPTAIN III (POLICE DEPARTMENT)  155966.02
2                      CAPTAIN III (POLICE DEPARTMENT)  212739.13
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC   77916.00
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)  134401.60
...                                                ...        ...
148640                         Parking Control Officer       0.00
148641                                    Museum Guard       0.00
148642                                     Sign Worker       0.00
148643                         Parking Control Officer       0.00
148644                    Stationary Eng, Sewage Plant       0.00

        OvertimePay   OtherPay  Benefits   TotalPay  TotalPayBenefits  Year  \
0              0.00  400184.25       NaN  567595.43         567595.43  2011
1         245131.88  137811.38       NaN  538909.28         538909.28  2011
2         106088.18   16452.60       NaN  335279.91         335279.91  2011
3          56120.71  198306.90       NaN  332343.61         332343.61  2011
4           9737.00  182234.59       NaN  326373.19         326373.19  2011
...             ...        ...       ...        ...               ...   ...
148640         0.00       0.00       0.0       0.00              0.00  2014
148641         0.00       0.00       0.0       0.00              0.00  2014
148642         0.00       0.00       0.0       0.00              0.00  2014
148643         0.00       0.00       0.0       0.00              0.00  2014
148644         0.00       0.00       0.0       0.00              0.00  2014

        Notes         Agency Status
0         NaN  San Francisco    NaN
1         NaN  San Francisco    NaN
2         NaN  San Francisco    NaN
3         NaN  San Francisco    NaN
4         NaN  San Francisco    NaN
...       ...            ...    ...
148640    NaN  San Francisco     PT
148641    NaN  San Francisco     PT
148642    NaN  San Francisco     PT
148643    NaN  San Francisco     PT
148644    NaN  San Francisco     PT

[148645 rows x 13 columns]

In [54]:
# Q1. 평균 basypay
sal['BasePay'].mean()

66327.6889596918

In [55]:
# Q2. 최대 OvertimePay
sal['OvertimePay'].max()

245131.88

In [65]:
# Q3. JOSEPH DRISCOLL의 job title
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [66]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [71]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [72]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']

110530    David P Kucia
Name: EmployeeName, dtype: object

In [73]:
sal[sal['Year'] == 2011]['BasePay'].mean()

63595.956516774524

In [74]:
sal[sal['Year'] == 2012]['BasePay'].mean()

65436.40685742255

In [75]:
sal[sal['Year'] == 2013]['BasePay'].mean()

69630.0302164812

In [76]:
sal[sal['Year'] == 2014]['BasePay'].mean()

66573.15420422914

In [86]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [87]:
len(sal.groupby(['JobTitle']))
sal['JobTitle'].nunique()

2158

In [85]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [92]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

477

### 2. 데이터 베이스
#### 2-1. 다중 사용자 환경
- 동일한 데이터를 여러 프로세스가 동시에 접근해서 변경하려고 들 때, 한 프로세스의 변경이 다른 프로세스의 변경을 무효화해서는 안된다.
- 다수 사용자에 대응할 수 있는 실시간 트랜잭션 처리 기능을 갖춘, 데이터의 정합성을 보장하는 데이터 관리 프로세스 필요: DBMS

In [94]:
# 문제 발생!!!!!
C_account = 100      # 현재 C 고객 계좌 잔고는 100

C_account_by_A_process = 100    # A 고객 응대 프로그램이 C 고객 계좌 잔고를 조회했습니다 
C_account_by_B_process = 100    # B 고객 응대 프로그램이 C 고객 계좌 잔고를 조회했습니다 

C_account_by_A_process = C_account_by_A_process + 50   # A 고객이 50을 입금했습니다. 
C_account_by_B_process = C_account_by_B_process + 30   # A 고객이 30을 입금했습니다. 

C_account = C_account_by_A_process     # A 고객의 입금이 C 고객 계좌 잔고에 반영되었습니다. 
C_account = C_account_by_B_process     # B 고객의 입금이 C 고객 계좌 잔고에 반영되었습니다. 

print(C_account)     # C 고객 계좌 잔고는 얼마일까요?

130

#### 2-2. 관계형 데이터베이스
- 키(key)와 값(value)들의 간단한 관계를 테이블화 시킨 매우 간단한 원칙의 전산정보 데이터베이스이다.

#### 2-3. SQL문
- DDL: 데이터 정의어
    - 테이블이나 관계의 구조를 생성하는 데 사용합니다. 테이블, 데이터베이스, 사용자에 대한 생성, 삭제 제약조건, 권한을 설정
- DML: 데이터 조작어
    - 테이블의 데이터를 조회, 삽입, 갱신, 삭제할 때 사용
        - 생성(Create): INSERT 문 사용
        - 조회(Read): SELECT 문 사용
        - 갱신(Update): UPDATE 문 사용
        - 삭제(Delete): DELETE문 사용

#### 2-4. 파이썬 DB-API
- SQLite 내장
    - connect(): 데이터베이스의 연결을 만든다.
    - cursor(): 질의를 관리하기 위한 커서 객체를 만든다. (file의 open과 비슷)
    - execute(), excutemany(): 데이터베이스에 하나 이상의 SQL명령을 실행한다.
    - fetchone(), fetchmany(), fetchall(): 실행 결과를 얻는다.

1) connect()

In [95]:
import sqlite3
conn = sqlite3.connect('example.db')

2) cursor(): 커서 객체 만들기

In [96]:
c = conn.cursor()

3) 쿼리 명령어 : execute(), executemany()

In [97]:
# Create table
c.execute('''CREATE TABLE stocks
             (date text, trans text, symbol text, qty real, price real)''')

# Insert a row of data
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

4) 데이터베이스에 반영: commit()
- 쿼리 명령어를 데이터베이스에 반영하기 위해선 꼭 commit() 함수를 써주어야 해요.

In [99]:
conn.commit()

5) 종료: close()
데이터베이스 관련 작업이 끝나면 종료를 해주세요. 파일 객체를 종료하는 것과 비슷합니다.

In [101]:
conn.close()

#### 2-5. DB-API 구현

In [102]:
import sqlite3

conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

In [103]:
#sales 테이블에 데이터 삽입
data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

In [104]:
# sales 테이블에 질의
cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

In [105]:
# 출력 데이터 갯수 세기
row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4

In [107]:
import sqlite3

conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4